<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.BBEdit</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>BBEdit-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>JamfSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>BBEdit</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>BBEdit is the leading professional HTML and text editor for the Mac.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.grahampugh-recipes.jamf.BBEdit</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>BarebonesURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>a28e56e90ebc52512a4b7ec8fe1981bf02e92bc5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Barebones/BarebonesURLProvider.py</string>
				<key>sha256_hash</key>
				<string>18f939879423d19946fe0f17b3fedba75e4312c0f8026f17629daac54b028d6d</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>febfabb5d43579197a98dd738b85840321c2a369</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</key>
			<dict>
				<key>git_hash</key>
				<string>febfabb5d43579197a98dd738b85840321c2a369</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py</string>
				<key>sha256_hash</key>
				<string>aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>febfabb5d43579197a98dd738b85840321c2a369</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</key>
			<dict>
				<key>git_hash</key>
				<string>febfabb5d43579197a98dd738b85840321c2a369</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py</string>
				<key>sha256_hash</key>
				<string>5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.bbedit</key>
			<dict>
				<key>git_hash</key>
				<string>55e47128864841e568cf20ccd2b852fea48faa50</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Barebones/BBEdit.download.recipe</string>
				<key>sha256_hash</key>
				<string>6d8e8c3699f23f9c0511f6e2d6a14c7400b890a729f688014adb287d3666eb03</string>
			</dict>
			<key>com.github.autopkg.grahampugh-recipes.jamf.BBEdit</key>
			<dict>
				<key>git_hash</key>
				<string>a802b4b5c78a6b87e39db23ab31f34978dcf9772</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/Jamf_Recipes/BBEdit.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>212336db974ae32f5e0a9130becb82b7e9b974c1ee06869c77dcb06069ff7fab</string>
			</dict>
			<key>com.github.autopkg.pkg.BBEdit</key>
			<dict>
				<key>git_hash</key>
				<string>fe5ced1ce7f937d31dc3fb9a8a27e1fa5b2b8961</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Barebones/BBEdit.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>2553d3611c9b999c4db7c38dccfd519a82314075c2438d3f2b80e7df514b8b68</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
