<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Camtasia DMG from the TechSmith web site. (Currently &quot;Camtasia 2023&quot;)</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Camtasia</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://download.techsmith.com/camtasiamac/releases/Camtasia.dmg</string>
		<key>NAME</key>
		<string>Camtasia</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>deep_verification</key>
				<true/>
				<key>input_path</key>
				<string>%pathname%/Camtasia*.app</string>
				<key>requirement</key>
				<string>identifier "com.techsmith.camtasia2024" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TQL462TU8"</string>
				<key>strict_verification</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>