<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Snagit and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.sabar1k.pkg.snagit</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Snagit 2024</string>
		<key>NAME</key>
		<string>Snagit</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.sabar1k.download.snagit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>