<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Miro and creates a universal package installer for Intel and ARM.</string>

    <key>Identifier</key>
    <string>com.github.sabar1k.pkg.MiroUniversal</string>

    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Miro</string>
        <key>Intel-NAME</key>
        <string>Miro-Intel</string>
        <key>ARM-NAME</key>
        <string>Miro-ARM</string>
    </dict>

    <key>MinimumVersion</key>
    <string>0.2.5</string>

    <key>ParentRecipe</key>
    <string>com.github.sabar1k.download.MiroUniversal</string>

    <key>Process</key>
    <array>

        <!-- Mount and extract Intel -->
        <dict>
            <key>Processor</key>
            <string>DmgMounter</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Miro-Intel.dmg</string>
                <key>mount_point_output_variable</key>
                <string>intel_mount_path</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%intel_mount_path%/Miro.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/Intel/Miro-Intel.app</string>
            </dict>
        </dict>

        <!-- Mount and extract ARM -->
        <dict>
            <key>Processor</key>
            <string>DmgMounter</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Miro-ARM.dmg</string>
                <key>mount_point_output_variable</key>
                <string>arm_mount_path</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%arm_mount_path%/Miro.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/ARM/Miro-ARM.app</string>
            </dict>
        </dict>

        <!-- Build Intel pkg
        <dict>
            <key>Processor</key>
            <string>BuildArchSpecificPkg</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/Intel/Miro-Intel.app</string>
                <key>architecture</key>
                <string>x86_64</string>
                <key>output_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Intel.pkg</string>
            </dict>
        </dict>

        Build ARM pkg
        <dict>
            <key>Processor</key>
            <string>BuildArchSpecificPkg</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/ARM/Miro-ARM.app</string>
                <key>architecture</key>
                <string>arm64</string>
                <key>output_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-ARM.pkg</string>
            </dict>
        </dict> -->

        <!-- Wrap into Universal -->
        <dict>
            <key>Processor</key>
            <string>BuildUniversalWrapperPkg</string>
            <key>Arguments</key>
            <dict>
                <key>intel_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/Intel/Miro-Intel.app</string>
                <key>arm_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/ARM/Miro-ARM.app</string>
                <key>output_universal_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Universal.pkg</string>
            </dict>
        </dict>

    </array>
</dict>
</plist>