<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Intel and Apple Silicon versions of Miro, creates a Universal app, and packages it.</string>
    <key>Identifier</key>
    <string>com.yourorg.pkg.Miro-Universal</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Miro</string>
        <key>intel_url</key>
        <string>https://desktop.miro.com/platforms/darwin/Install-Miro.dmg</string>
        <key>arm_url</key>
        <string>https://desktop.miro.com/platforms/darwin-arm64/Install-Miro.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>Process</key>
    <array>

        <!-- Download Intel -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%intel_url%</string>
                <key>download_path</key>
                <string>%RECIPE_CACHE_DIR%/Install-Miro-Intel.dmg</string>
            </dict>
        </dict>

        <!-- Mount Intel -->
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/Install-Miro-Intel.dmg</string>
                <key>app_path</key>
                <string>Miro.app</string>
                <key>output_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Intel.app</string>
            </dict>
        </dict>

        <!-- Download ARM -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%arm_url%</string>
                <key>download_path</key>
                <string>%RECIPE_CACHE_DIR%/Install-Miro-ARM.dmg</string>
            </dict>
        </dict>

        <!-- Mount ARM -->
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/Install-Miro-ARM.dmg</string>
                <key>app_path</key>
                <string>Miro.app</string>
                <key>output_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-ARM.app</string>
            </dict>
        </dict>

        <!-- Combine binaries -->
        <dict>
            <key>Processor</key>
            <string>UniversalLipoCombiner</string>
            <key>Arguments</key>
            <dict>
                <key>intel_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Intel.app</string>
                <key>arm_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-ARM.app</string>
                <key>output_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Universal.app</string>
            </dict>
        </dict>

        <!-- Create package root -->
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>

        <!-- Copy the app into pkgroot -->
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Universal.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Miro.app</string>
            </dict>
        </dict>

        <!-- Create the PKG -->
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-Universal</string>
                    <key>id</key>
                    <string>com.miro.universal</string>
                    <key>version</key>
                    <string>1.0</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>

    </array>
</dict>
</plist>