<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Mounts Intel and ARM Miro downloads, creates a universal app, and packages it.
    </string>
    <key>Identifier</key>
    <string>com.yourorg.pkg.MiroUniversal</string>
    <key>ParentRecipe</key>
    <string>com.yourorg.download.MiroUniversal</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Miro</string>
    </dict>
    <key>Process</key>
    <array>

        <!-- Mount Intel -->
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
					<string>%pathname%</string>
            </dict>
        </dict>

        <!-- Mount ARM -->
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
					<string>%pathname%</string>
            </dict>
        </dict>

        <!-- Combine into Universal -->
        <dict>
            <key>Processor</key>
            <string>UniversalLipoCombiner</string>
            <key>Arguments</key>
            <dict>
                <key>intel_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Intel.app</string>
                <key>arm_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-ARM.app</string>
                <key>output_app_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Universal.app</string>
            </dict>
        </dict>

        <!-- Build Pkg Root -->
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>

        <!-- Copy into Applications -->
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Universal.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Miro.app</string>
            </dict>
        </dict>

        <!-- Create pkg -->
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-Universal</string>
                    <key>id</key>
                    <string>com.miro.universal</string>
                    <key>version</key>
                    <string>1.0</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>

    </array>
</dict>
</plist>