<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Miro and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.sabar1k.pkg.MiroUniversal</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Miro</string>
            <key>Intel-NAME</key>
            <string>Miro-Intel</string>
            <key>ARM-NAME</key>
            <string>Miro-ARM</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.5</string>
		<key>ParentRecipe</key>
		<string>com.github.sabar1k.download.MiroUniversal</string>
    <key>Process</key>
    <array>

<!-- Mount and extract Intel -->
<dict>
    <dict>
    <key>Processor</key>
    <string>DmgMounter</string>
    <key>Arguments</key>
    <dict>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/Miro-Intel.dmg</string>
        <key>mount_point_output_variable</key>
        <string>intel_mount_path</string>
    </dict>
</dict>
<dict>
    <key>Processor</key>
    <string>Copier</string>
    <key>Arguments</key>
    <dict>
        <key>source_path</key>
        <string>%pathname%/Miro.app</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/Applications/Intel/Miro-Intel.app</string>
    </dict>
</dict>


<!-- Mount and extract ARM -->
<dict>
    <key>Processor</key>
    <string>AppDmgVersioner</string>
    <key>Arguments</key>
    <dict>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/Miro-ARM.dmg</string>
    </dict>
</dict>
<dict>
    <key>Processor</key>
    <string>Copier</string>
    <key>Arguments</key>
    <dict>
        <key>source_path</key>
        <string>%pathname%/Miro.app</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/Applications/ARM/Miro-ARM.app</string>
    </dict>
</dict>

   <dict>
    <key>Processor</key>
    <string>UniversalLipoCombiner</string>
    <key>Arguments</key>
    <dict>
        <key>intel_app_path</key>
        <string>%RECIPE_CACHE_DIR%/Applications/Intel//Miro-Intel.app</string>
        <key>arm_app_path</key>
        <string>%RECIPE_CACHE_DIR%/Applications/ARM/Miro-ARM.app</string>
        <key>output_app_path</key>
        <string>%RECIPE_CACHE_DIR%/Miro-Universal.app</string>
        <key>binary_relative_path</key>
        <string>Contents/MacOS/Miro</string>
    </dict>
</dict>

        <!-- Create package root -->
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>

        <!-- Copy the app into pkgroot -->
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/Miro-Universal.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Miro.app</string>
            </dict>
        </dict>

        <!-- Create the PKG -->
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-Universal</string>
                    <key>id</key>
                    <string>com.miro.universal</string>
                    <key>version</key>
                    <string>1.0</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>

    </array>
</dict>
</plist>